# Модульное задание №1
# Создать простую консольную программу – что-то вроде маленького приложения, где можно управлять списком задач (todo-list).

# Она должна уметь:
#  - Создавать задачу (название, описание, приоритет, статус, id).
#  - Просматривать задачи (как есть, отсортированные или через поиск).
#  - Обновлять задачу (менять название, описание, приоритет или статус).
#  - Удалять задачу.
#  - Хранить задачи в файле json (чтобы при перезапуске они не терялись).

# Что такое задача
# Задача – это набор данных:
    #   id – уникальный номер (1, 2, 3, …). Новый id всегда на 1 больше, чем максимальный из существующих или смользование модуля uuid (new_id = str(uuid.uuid4())[:3]).
    #   название (например: "Купить продукты").
    #   описание (например: "Сходить в магазин и купить хлеб, молоко").
    #   приоритет – низкий / средний / высокий.
    #   статус – новая / в процессе / завершена.
{
    1: {"title": "Купить хлеб", "desc": "Магазин у дома", "priority": "high", "status": "new"},
    2: {"title": "Сделать домашку", "desc": "Уроки по питону", "priority": "medium", "status": "in progress"}
}

# Как всё должно работать
# Когда запускаешь программу, тебе выводится главное меню:
#     1 – Создать новую задачу
#     2 – Просмотреть задачи
#     3 – Обновить задачу
#     4 – Удалить задачу
#     0 – Выйти
# Пользователь выбирает цифру, и программа делает соответствующее действие.

# 1. Создание задачи:
        # Пользователь вводит название и описание.
        # Потом выбирает приоритет (1 – низкий, 2 – средний, 3 – высокий).
        # Потом статус (1 – новая, 2 – в процессе, 3 – завершена).
        # Программа сама назначает id.

# 2. Просмотр задач:
        # Дополнительное меню:
            # 1 – показать как есть
            # 2 – отсортировать по статусу
            # 3 – отсортировать по приоритету
            # 4 – поиск (ищем слово в названии или описании, без учёта регистра).

# 3. Обновление задачи:
        # Пользователь вводит id задачи → выбирает, что именно поменять (название/описание/приоритет/статус) → вводит новое значение.

# 4. Удаление задачи:
        # Вводим id → если задача есть, удаляем её.
