# Всего у нас будет 40 встреч, из них 32 теоритическин лекции. Всё обучение разбито на модули, после окончания каждого модуля вы будете исполнять самостоятельно практическое задание на протежении одной нашей встречи.

# Для начала напомним себе некоторые основные понятия:
# Что такое программирование?
# Программирование — это процесс создания инструкций, которые позволяют компьютеру выполнять определенные задачи. Эти инструкции называются программами. Программы могут решать широкий спектр задач, от простых вычислений до управления сложными системами и автоматизации процессов. Программирование требует логического мышления и умения решать проблемы.
# По сути программирование состоит из двух частей. Это алгоритмы и структуры данных.

# Алгоритмы — это четкие последовательности действий, которые описывают, как решить конкретную задачу. Они являются основой программирования, так как позволяют разработчикам точно указать, что должно быть сделано для достижения цели. Примеры алгоритмов включают сортировку данных, поиск значений и выполнение математических вычислений.

# Стеденты у которых я препадав Frontend могут меня спросить почему, я им эти понятия не раскрывал ведь JS это тоже ксть язык програмирование. Да, вы будете совершенно правы, но тут есть маленькая ремарочка JavaScript мы изучали как рисовать кнопки, формы, меняем стили, обрабатываем клики, писали простые функции и циклы, но сразу «на практике», чтобы страница работала. В таком подходе упор шёл на визуальный результат, а не на теорию «алгоритмы и структуры данных». Поэтому мы на курсе по JS не акцентировали внимание на фундаментальной информатике.

# Python же являеться универсальный язык как для обучения основам программирования, так и для алгоритмов, математики, анализа данных, и серверной разработки.

# Где можно применять язык Python?
# Веб-разработка: Создание серверной логики для веб-приложений (Django, Flask).
# Научные исследования и анализ данных: Инструменты для работы с большими данными, машинное обучение (NumPy, Pandas, TensorFlow, scikit-learn).
# Автоматизация и скриптинг: Автоматизация рутинных задач (Selenium, BeautifulSoup).
# Разработка игр: Создание простых игр и графических приложений (Pygame).
# Встроенные системы: Программирование микроконтроллеров (MicroPython).


# Python-программы обычно пишутся в текстовом файле с расширением .py и запускаются с помощью интерпретатора Python.

# print("Hello World!")
# Переменная — это именованная область памяти, которая используется для хранения данных, которые могут изменяться во время выполнения программы

# x = 5
# a = "Hello"
# print(type("3"))

# name = "Alice"
# age = 30
# print("Name:", name, "Age:", age)

# основнык арифметические операции:
# operátor přiřazení = 
# rovnat se ==
# ne rovna se !=
# větší než > 
# menší než <
# větší nebo rovno >=
# menší nebo rovno <=
# sčítání: +
# odčítání: -
# násobení: *
# dělení: /
# mocnění: **                возводит в степень 2 ** 3 (2 в 3 степени) zvyšuje na sílu 2 ** 3 (2 na 3)
# celočíselné dělení: //     делит числа без остатка 7 // 2 = 3
# zbytek po dělení: %
# name = input("Привет, напиши как тебя зовут ")

# Перевод мкжду типами данных:
# print(float(5))
# int()
# str()
# type()



# Практические задания
# Запустите
# print("Hello, world!")
# С этого начинается изучение любого языка программирования, это традиция
# Создайте переменные a и b, присвойте им значения 10 и 20 соответственно. Выполните сложение, вычитание, умножение и деление этих переменных и выведите результаты.
# Создайте переменную text со значением "Python". Умножьте эту строку на 3 и выведите результат.
# Создайте переменную name со значением вашего имени и переменную age с вашим возрастом. Создайте строку, которая будет содержать сообщение вида "Меня зовут [имя], мне [возраст] лет." и выведите ее.
# Напишите программу, которая считает выражение (5 + 3) * 2 ** 2 и выводит результат.
# Попробуйте сложить строку и число без приведения типов и исправьте ошибку, используя явное преобразование типов.
# Сделать задачи 1, 2, 3 при помощи input

# name = "Alex"
# age = 30
# text = "Меня зовут " + name + ", мне " + str(age) + " лет."
# print(text)

# text = f"Меня зовут {name}, мне {age} лет."
# print(text)



# логическое not - преобразует True в False и наоборот. Сначала преобразует значение в булево, а затем меняет на противоположное.
# print( not 5 == 5) # False
# not True  # False
# not False  # True
# not ''  # True
# not 33  # False
# print(not 0) # True
# print(5 != 4) # True


# лошическое in - поиск подколлекции в коллекции. На этом уровне знаний используется для поиска вхождения одной строки в другую:

# 'ab' in 'bcde'  # False
# 'ab' in 'abcd'  # True
# print("lo" in "hello") # True
# print("adc" not in "hryhhguj") # True


# is - ИСПОЛЬЗУЕТСЯ ТОЛЬКО С ПЕРЕМЕННЫМИ, это проверка, находятся ли две переменные в одном и том же месте в памяти. Это немного сложно для понимания, и будет намного проще объяснить это, когда вы будете знать другие типы данных. Но объясню на некоторых примерах:
# == → проверяет значения (равны ли они)
# is → проверяет идентичность объектов (ссылаются ли они на один и тот же объект в памяти).
a = 500
b = 500
print(a == b) # True
# a is b  # False
# c = 500
# d = c
# c is d  # True

# Обычно is используют для проверки на None или на булевые константы True / False.
# x = None
# if x is None:
#     print("x пустой")
# if x is not None:
#     print("x не пустой")

# Для маленьких чисел (обычно от -5 до 256 и строк до 20 символов) Python гарантированно использует одни и те же объекты (кэш интернирования).
# Для больших чисел (как 500) поведение может отличаться:
# В интерактивной консоли (REPL, Jupyter, IDLE) интерпретатор часто кэширует такие числа, и is даёт True.

# l = [1, 2, 3]
# l2 = l.copy()
# print(l is l2)# False
# print(id(l))
# print(id(l2))

# a = 500
# b = 500
# print(a is b) # True
# print(id(a))
# print(id(b))

# a = int("500")
# b = int("500")
# print(a is b) # False
# print(id(a))
# print(id(b))

# 📌 Где использовать == vs is
# 🔹 Используй ==, когда хочешь сравнить значения объектов
# Числа
a = 500
b = 500
print(a == b)  # ✅ True (значения равны)

# Списки
l1 = [1, 2, 3]
l2 = [1, 2, 3]
print(l1 == l2)  # ✅ True (содержимое одинаковое)

# Строки
s1 = "hello world"
s2 = "hello world"
print(s1 == s2)  # ✅ True

# 🔹 Используй is, когда проверяешь идентичность объектов (тот же самый объект в памяти)
# None
x = None
print(x is None)  # ✅ Правильно
print(x == None)  # ⚠️ Работает, но так писать не принято

# True / False (булевы значения)
flag = True
print(flag is True)   # Работает, но обычно пишут просто: if flag:
print(flag is False)  # Работает, но обычно: if not flag:

# Одна и та же ссылка
l1 = [1, 2, 3]
l2 = l1
print(l1 is l2)  # ✅ True (это одна и та же область памяти)

# 📌 Золотое правило
# == → проверка значений
# is → проверка одного и того же объекта в памяти

# ⚡️ В реальной практике:
# для сравнения данных (чисел, строк, списков) → ==
# для проверки None, True, False, а также когда важно, что это один и тот же объект → is

# match case switch case
# Идея в том, что мы можем задать несколько опций для проверки нашей переменной и выполнить только те, где наша проверка будет истинной.

# status = 400
# match status:
#     case 400:
#         print("Bad request")
#     case 401:
#         print("Unauthorized")
#     case 403:
#         print("Forbidden")
#     case 404:
#         print("Not found")


# value = "Alex"

# match value:
#     case str():
#         print("Это строка")
#     case int():
#         print("Это целое число")


# Распаковка структур
# point = (3, 4)

# match point:
#     case (0, 0):
#         print("Начало координат")
#     case (x, 0):
#         print(f"Точка на оси X: {x}")
#     case (0, y):
#         print(f"Точка на оси Y: {y}")
#     case (x, y):
#         print(f"Произвольная точка: {x}, {y}")


# number = 42

# match number:
#     case n if n % 2 == 0:
#         print("Число чётное")
#     case n if n % 2 != 0:
#         print("Число нечётное")


#-------------------------------- Домашнее задание:

# 1. Пользователь вводит число n.
# Если число делится на 3 и при этом не делится на 5, вывести "Fizz".
# Если делится на 5 и при этом не делится на 3, вывести "Buzz".
# Если делится и на 3, и на 5, вывести "FizzBuzz". При проверки используем целочисленное деление.
# А если ни то, ни другое — вывести само число.

# n = int(input("Введите любое число: "))

# if (n % 3 == 0 and n % 5 == 0):
#     print("FizzBuzz")
# elif n % 3 == 0:
#     print("Fizz")
# elif n % 5 == 0:
#     print("Buzz")
# else:
#     print(n)


# 2. Проверка высокосного года: Пользователь вводит год. Год будет высокосный если он кратно делится на 4, но при этом не делится на 100, либо если он кратно делится на 400.

# year = int(input("Ведите год: "))
# if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
#     print(f"Год {year} высокосный")
# else:
#     print(f"Год {year} невысокосный")


# 3.  Треугольник существует ли?
# Пусть заданы три стороны a, b, c.
# Если сумма любых двух сторон строго больше третьей → треугольник существует. В противном случаи  - не существует.
# Если условие выполняется и все стороны равны → вывести "Равносторонний".
# Если только две стороны равны → "Равнобедренный".
# Иначе → "Разносторонний".
# Если треугольник не существует → вывести "Это не треугольник".

# a = float(input("Введите сторону a: "))
# b = float(input("Введите сторону b: "))
# c = float(input("Введите сторону c: "))

# # Проверка существования треугольника
# if a + b > c and a + c > b and b + c > a:
#     # Существующий треугольник, проверяем тип
#     if a == b == c:
#         print("Равносторонний треугольник")
#     elif a == b or b == c or a == c:
#         print("Равнобедренный треугольник")
#     else:
#         print("Разносторонний треугольник")
# else:
#     # Если не выполняется неравенство треугольника
#     print("Это не треугольник")


# 4. Магазин скидок
# Покупатель вводит сумму покупки.
# Если сумма больше 10 000 крон и день недели "суббота" или "воскресенье" → скидка 20%.
# Если сумма больше 5 000 и день рабочий → скидка 10%.
# Если сумма меньше или равна 1 000 → скидки нет.
# Вывести итоговую цену с учётом скидки. День недели можна ввести в ручную пользователем.

# Ввод суммы покупки
# price = float(input("Введите сумму покупки: "))

# # Ввод дня недели вручную
# day = input("Введите день недели (например, понедельник): ")

# # Расчёт скидки
# if price > 10000 and (day == "суббота" or day == "воскресенье"):
#     discount = 0.2  # 20%
# elif price > 5000 and (day == "понедельник" or day == "вторник" or day == "среда" or day == "четверг" or day == "пятница"):
#     discount = 0.1  # 10%
# elif price <= 1000:
#     discount = 0.0  # скидки нет
# else:
#     discount = 0.0

# final_price = price * (1 - discount)

# # Вывод результата
# print(f"Итоговая сумма с учётом скидки: {final_price:2f} крон.")



# Спросить у пользователя возраст, пол и имя. Для всех младше 15 мы пишем, что рекомендуем теннис, для мальчиков старше 15 рекомендуем футбол, для девочек - баскетбол, но если в имени есть буква 'c' или 't', пишем, что не рекомендуем заниматься спортом.
# Условия:
# Запросить у пользователя возраст, пол и имя.
# Если возраст < 15 → рекомендуем теннис.
# Если возраст ≥ 15:
# мальчик → футбол
# девочка → баскетбол
# Если в имени есть буква c или t (без учёта регистра) → не рекомендуем спорт.
# age = int(input("Введите возраст: "))
# gender = input("Введите пол (m/f): ").lower()
# name = input("Введите имя: ").lower()

# if "c" in name or "t" in name:
#     print("Мы не рекомендуем заниматься спортом")
# elif age < 15:
#     print("Рекомендуем теннис")
# elif gender == "m":
#     print("Рекомендуем футбол")
# elif gender == "f":
#     print("Рекомендуем баскетбол")
# else:
#     print("Пол указан некорректно")
    
# Рещение через структуру match....case
# age = int(input("Введите возраст: "))
# gender = input("Введите пол (m/f): ").lower()
# name = input("Введите имя: ").lower()

# # Сначала проверяем запрет по имени
# if "c" in name or "t" in name:
#     print("Мы не рекомендуем заниматься спортом")
# else:
#     match (age, gender):
#         case (a, _) if a < 15:
#             print("Рекомендуем теннис")
#         case (a, "m") if a >= 15:
#             print("Рекомендуем футбол")
#         case (a, "f") if a >= 15:
#             print("Рекомендуем баскетбол")
#         case _:
#             print("Пол указан некорректно")